# Pandas - Column Operations (axis = 1)

In [1]:
import pandas as pd

In [12]:
dict = {'A' : [1 ,2, 3, 4, 5], 'B': ['a', 'b', 'c', 'd', 'e'], 'NUM': [0, 0, 0, 0, 0 ]}
df1 = pd.DataFrame(dict)
df1

   A  B  NUM
0  1  a    0
1  2  b    0
2  3  c    0
3  4  d    0
4  5  e    0

### Get column list

In [18]:
df3

   A  B  NUM
0  1  a    0
1  2  b    0
2  3  c    0
3  4  d    0
4  5  e    0

In [19]:
df3.columns

Index(['A', 'B', 'NUM'], dtype='object')

In [20]:
df3.columns.to_list()

['A', 'B', 'NUM']

### Select column subset

In [23]:
???

   A  B  NUM
1  2  b    0
2  3  c    0
3  4  d    0
4  5  e    0

### Add a new column

In [4]:
dictx = {'A' : [1 ,1, 3, 4, 5], 'B': ['a', 'a', 'c', 'd', 'e'], 'NUM': [0, 0, 0, 0, 0 ]}
dfx = pd.DataFrame(dictx)
dfx

   A  B  NUM
0  1  a    0
1  1  a    0
2  3  c    0
3  4  d    0
4  5  e    0

#### Add new column at the end

In [7]:
# with the same value in each row
dfx['X'] = 'X'
dfx

   A  B  NUM  X  ID
0  1  a    0  X   0
1  1  a    0  X   1
2  3  c    0  X   2
3  4  d    0  X   3
4  5  e    0  X   4

#### Add new column at a specific position

In [9]:
dfx.insert(2, 'NEW_X', [10, 20, 30, 40, 50])
dfx

   A  B  NEW_X  NUM  X  ID
0  1  a     10    0  X   0
1  1  a     20    0  X   1
2  3  c     30    0  X   2
3  4  d     40    0  X   3
4  5  e     50    0  X   4

### Add new column with an incremental values in each row

In [11]:
dfx['ID'] = range(len(dfx)) 
dfx

   NEW_COLUMN  B  NUM  ID
0           1  a    0   0
1           1  a    0   1
2           3  c    0   2
3           4  d    0   3
4           5  e    0   4

#### Using assign method

In [23]:
dfxr1 = dfx.assign(row_number=range(1,len(dfx)+1)) # the new column will be called 'row_number'
dfxr1

   A  B  NUM  row_number
0  1  a    0           1
1  1  a    0           2
2  3  c    0           3
3  4  d    0           4
4  5  e    0           5

In [22]:
dictx = {'A' : [1 ,1, 3, 4, 5], 'B': ['a', 'a', 'c', 'd', 'e'], 'NUM': [0, 0, 0, 0, 0 ]}
dfx = pd.DataFrame(dictx)
dfx

   A  B  NUM
0  1  a    0
1  1  a    0
2  3  c    0
3  4  d    0
4  5  e    0

### Remove column

In [2]:
dfx = pd.DataFrame({'A' : [1 ,1, 3, 4, 5], 'B': ['a', 'a', 'c', 'd', 'e'], 'NUM': [0, 0, 0, 0, 0 ]})
dfx

   A  B  NUM
0  1  a    0
1  1  a    0
2  3  c    0
3  4  d    0
4  5  e    0

In [3]:
dfx.drop(['B', 'NUM'], axis=1, inplace=True)
dfx

   A
0  1
1  1
2  3
3  4
4  5

### Select a subset of columns in a predefined order

In [5]:
dfx = pd.DataFrame({'A' : [1 ,1, 3, 4, 5], 'B': ['a', 'a', 'c', 'd', 'e'], 'NUM': [0, 0, 0, 0, 0 ]})
dfx

   A  B  NUM
0  1  a    0
1  1  a    0
2  3  c    0
3  4  d    0
4  5  e    0

In [8]:
df = dfx[['NUM','B']]
df

   NUM  B
0    0  a
1    0  a
2    0  c
3    0  d
4    0  e

### Rename column

In [9]:
dfx = pd.DataFrame({'A' : [1 ,1, 3, 4, 5], 'B': ['a', 'a', 'c', 'd', 'e'], 'NUM': [0, 0, 0, 0, 0 ]})
dfx

   A  B  NUM
0  1  a    0
1  1  a    0
2  3  c    0
3  4  d    0
4  5  e    0

In [10]:
dfx.rename({'A' : 'NEW_COLUMN'}, axis=1, inplace=True)
dfx

   NEW_COLUMN  B  NUM
0           1  a    0
1           1  a    0
2           3  c    0
3           4  d    0
4           5  e    0